clear;clc;

S=14186500;%易感人群
E=4007;%潜伏期
I=495;%感染者
R=31;%康复者

N = S+E+I+R %总数

r1=10;%潜伏期患者每天接触的人
r2=2;%感染者每天接触的人
b1=0.03;%接触潜伏期患者感染概率
b2=0.03;%接触感染者感染概率
a=0.03;%潜伏期患者出现症状的概率

%r=0.007; %患者康复概率
%d=2.7*10^(-4); %患者死亡概率

[r,d] = getData();

days = 150;

for i =1:150
    S(i+1)=S(i)-(r1*b1*E(i)*(S(i)/N)+r2*b2*I(i)*(S(i)/N));
    E(i+1)=E(i)+(r1*b1*E(i)*(S(i)/N)+r2*b2*I(i)*(S(i)/N))-(E(i)*a);
    I(i+1)=I(i)+(E(i)*a)-(I(i)*r+I(i)*d);
    R(i+1)=R(i)+I(i)*r;
    N=S(i+1)+E(i+1)+ I(i+1)+ R(i+1);
end

x=1:days+1;
plot(x,S,x,E,x,I,x,R);
grid on;
xlabel('天数');
ylabel('人数');
legend('易感人群','潜伏期患者','感染者','康复者')
